{
  "backend/main.mo": "Main actor implementing a relationship app with user profiles, chat messages, drawings, notes, memories, reactions, and daily check-in questions; includes authorization via MixinAuthorization and blob storage via MixinStorage with migration support.",
  "backend/migration.mo": "Migration module that adds a scheduledQuestions field to the actor state while preserving all existing data structures for user profiles, messages, drawings, notes, memories, questions, answers, and reactions.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: displaying 'Takshi' and 'Aashi' sender names, applying consistent name display logic across all pages, restricting admin panel access to Takshi only, and implementing automatic daily question scheduling.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration; describes authentication removal, identity selection via localStorage, profile fallback logic, and admin access restrictions.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining pastel light and dark theme variables for backgrounds, foregrounds, borders, and component colors.",
  "frontend/index.html": "HTML entry point with noindex/nofollow meta tags for privacy and title 'Our Little World'.",
  "frontend/public/robots.txt": "Robots.txt file that disallows all web crawlers to keep the site private.",
  "frontend/src/App.tsx": "Root app component wrapping AppShell with ThemeProvider (light mode default) and Toaster for notifications.",
  "frontend/src/components/AppShell.tsx": "Main shell with navigation, page routing, and identity management; restricts admin panel access to selectedIdentity === 'takshi' with route guard and access denied screen; listens for identity changes via storage and custom events.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders individual chat messages with avatar, timestamp, and sender name, supporting text, emoji, and GIF message types.",
  "frontend/src/components/EmojiPicker.tsx": "Emoji picker grid component with curated romantic and expressive emojis for chat input.",
  "frontend/src/components/FloatingHeartsBackground.tsx": "Decorative component rendering animated floating heart emojis across the screen background.",
  "frontend/src/components/LoginButton.tsx": "Reusable login/logout button component (content truncated in source).",
  "frontend/src/components/MusicPlayer.tsx": "Audio player component with play/pause, volume control, and mute functionality for looping romantic instrumental music.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile with name and display name fields, using a mutation hook to save the profile.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state and identity persistence with AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profiles, messages, drawings, notes, memories, reactions, and daily check-ins with polling and error handling.",
  "frontend/src/hooks/useUserProfiles.ts": "Hook that batch-fetches multiple user profiles by principals and returns a map of principal strings to UserProfile objects.",
  "frontend/src/index.css": "Global styles with Tailwind configuration, pastel color palette, custom animations (floating hearts, glow), scrollbar styling, and background pattern overlay.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page for scheduling daily check-in questions, restricted to 'takshi' identity. Allows creating and editing questions with date selection, displays upcoming and past questions.",
  "frontend/src/pages/ChatPage.tsx": "Chat page component with real-time messaging, emoji picker, and GIF support. Displays last 100 messages with user profiles and auto-scrolls to newest messages.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Daily check-in page where users answer scheduled questions. Shows both users' answers once submitted, displays past questions, and includes admin hint for Takshi.",
  "frontend/src/pages/DailyNotesPage.tsx": "Daily notes page for creating and editing date-stamped notes. Groups notes by date, supports inline editing, and uses localStorage fallback for display names.",
  "frontend/src/pages/DoodlesPage.tsx": "Drawing canvas page with color picker, brush size control, and save functionality. Displays saved drawings with timestamps and supports touch/mouse input.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying a grid of navigation cards for different app sections (chat, doodles, notes, memories, reactions, settings, check-in, admin). Includes identity-based access control for admin panel (Takshi only) and listens for localStorage identity changes.",
  "frontend/src/pages/LoginPage.tsx": "Empty file with no content.",
  "frontend/src/pages/MemoryWallPage.tsx": "Photo memory wall page allowing users to upload images with captions (5MB limit), displays all memories in a grid with upload progress tracking. Uses ExternalBlob for file uploads and shows formatted timestamps for each memory.",
  "frontend/src/pages/ReactionsPage.tsx": "Page for sending quick reactions (hearts, hugs, kisses) with real-time counts and recent activity feed. Displays reaction buttons with gradient styling and shows who sent what reaction with timestamps.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page with identity selection (Takshi/Aashi) stored in localStorage and a music player component for background music. Dispatches custom events when identity changes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, clear, and remove parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended border radius values, custom shadows (including glow effects), and custom animations for accordions, floating elements, and glowing effects.",
  "project_state.json": "Project state tracking file containing four existing features (sender name display, consistent naming across apps, admin access restriction, automatic daily questions) and three pending feature requests. Configured for instant clarification mode with schema version 1.0.0."
}