{
  "backend/main.mo": "Main actor implementing a couples app with user profiles, chat messages, drawings, notes, memories, reactions, and daily check-in questions/answers; includes authorization mixin, blob storage mixin, and migration support with Principal-based user identification.",
  "backend/migration.mo": "Migration module that transforms old actor state (with 'sender', 'author', 'user' fields) to new actor state (with 'senderId', 'authorId', 'userId' fields) for all data types including messages, drawings, notes, memories, reactions, and questions.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: removing Internet Identity authentication, updating ProfileSetupModal for IP-based auto-prompting, and replacing Principal-based identification with IP-based identification throughout the app.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing components, pages, hooks, and configuration for a couples app with chat, drawings, notes, memories, reactions, daily check-ins, and admin panel; notes removal of authentication dependencies and IP-based identification.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH-based pastel color system for light and dark themes, including custom properties for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point with noindex/nofollow meta tags for privacy, titled 'Our Little World', and mounting React app to #root div.",
  "frontend/public/robots.txt": "Robots.txt file that disallows all web crawlers to keep the site private and non-indexed.",
  "frontend/src/App.tsx": "Root React component wrapping AppShell with ThemeProvider (light mode default) and Toaster for notifications.",
  "frontend/src/components/AppShell.tsx": "Main application shell with navigation menu, page routing, profile setup modal gating for new IP-based users, admin page access control, floating hearts background, header, and footer.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Chat message display component that renders text, emoji, or GIF messages with sender avatar, display name, and timestamp.",
  "frontend/src/components/EmojiPicker.tsx": "Emoji picker component displaying a grid of 48 curated emojis (romantic, expressive, celebratory) with click-to-select functionality.",
  "frontend/src/components/FloatingHeartsBackground.tsx": "Decorative component rendering 8 floating heart emojis with staggered animations across the screen background.",
  "frontend/src/components/LoginButton.tsx": "Reusable login/logout button component handling Internet Identity authentication and clearing React Query cache on logout.",
  "frontend/src/components/MusicPlayer.tsx": "Audio player component with play/pause, volume control, and mute functionality for looping romantic instrumental music.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile with name and display name fields, using a mutation hook to save the profile.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, messages, drawings, notes, memories, reactions, and daily check-ins with polling support.",
  "frontend/src/hooks/useUserProfiles.ts": "Hook that fetches multiple user profiles by principals in parallel and returns them as a map for efficient lookups.",
  "frontend/src/index.css": "Global styles with Tailwind configuration, pastel color palette, custom animations (floating hearts, glow), scrollbar styling, and background pattern overlay.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel for scheduling and managing daily check-in questions with date selection, create/edit forms, and lists of upcoming and past questions.",
  "frontend/src/pages/ChatPage.tsx": "Real-time chat interface with text and GIF message support, emoji picker, and displays last 100 messages with user profiles.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Daily question-answer page where users submit answers, view partner's answers once both submit, and access past questions history.",
  "frontend/src/pages/DailyNotesPage.tsx": "Daily notes feature allowing users to create, edit, and view notes grouped by day with author profiles.",
  "frontend/src/pages/DoodlesPage.tsx": "Canvas-based drawing board with color picker, brush size control, and gallery of saved drawings with timestamps.",
  "frontend/src/pages/HomePage.tsx": "Main navigation hub displaying grid of feature cards (chat, doodles, notes, memories, reactions, check-in, admin, settings) with conditional admin access.",
  "frontend/src/pages/LoginPage.tsx": "Empty/truncated file for user authentication and login functionality.",
  "frontend/src/pages/MemoryWallPage.tsx": "React page component for displaying and uploading photo memories with captions, featuring file validation, upload progress tracking, and a dialog-based upload interface with preview.",
  "frontend/src/pages/ReactionsPage.tsx": "React page component for sending and viewing reactions (hearts, hugs, kisses) with real-time counts and recent activity feed, using custom hooks for data fetching and mutations.",
  "frontend/src/pages/SettingsPage.tsx": "Simple settings page component that currently only contains a background music player card.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom animations (accordion, float-up, glow), extended border radius values, and custom box shadows.",
  "project_state.json": "Project state tracking document showing migration from Principal-based authentication to IP-based user identification, with existing features completed and pending feature requests for admin authorization updates."
}