{
  "kind": "build_request",
  "title": "Fix message sender display and enhance admin/daily question features",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Display 'Takshi' and 'Aashi' as sender names in chat messages instead of 'unknown'. When a message has no senderId or the senderId cannot be resolved to a profile, display the appropriate name based on the sender's identity (Takshi or Aashi).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "make sure not if instead of unknow when i send the message it should show takshi and aashi"
        ]
      },
      "acceptanceCriteria": [
        "Chat messages display 'Takshi' or 'Aashi' as sender names",
        "No messages show 'unknown' as the sender name",
        "Sender name correctly reflects the user's identity selection"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Apply the 'Takshi' and 'Aashi' sender name display logic consistently across all apps in the project (ChatPage, DailyCheckInPage, ReactionsPage, and any other pages that display user-generated content).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "this should be the case in all the apps"
        ]
      },
      "acceptanceCriteria": [
        "All pages that display user content show 'Takshi' or 'Aashi' names",
        "Consistent naming behavior across the entire application",
        "No instances of 'unknown' or unresolved sender names anywhere"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Restrict admin panel access exclusively to the user 'takshi'. Only Takshi should be able to access the admin panel page and see the admin panel navigation option.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "only takshi should have access to the admin pannel"
        ]
      },
      "acceptanceCriteria": [
        "Admin panel is only accessible when localStorage identity is 'takshi'",
        "Admin panel navigation card only appears for Takshi",
        "Aashi cannot access or see the admin panel"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement automatic daily question generation or scheduling to ensure a new question appears every day. The system should either automatically create new questions or ensure that scheduled questions appear daily without manual intervention.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "new question every day"
        ]
      },
      "acceptanceCriteria": [
        "A new daily check-in question appears automatically each day",
        "Users see a fresh question every 24 hours",
        "The system handles question rotation without requiring manual admin updates"
      ]
    }
  ],
  "constraints": [
    "Do not change the backend message schema or migration logic",
    "Maintain the existing localStorage-based identity system for 'takshi' and 'aashi'",
    "Preserve the current admin panel functionality while restricting access"
  ],
  "nonGoals": [
    "Changing the authentication or Internet Identity system",
    "Modifying the backend authorization checks beyond what's needed for daily questions",
    "Redesigning the user interface or navigation structure"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}