{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix message sender display and enhance admin/daily question features",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Display 'Takshi' and 'Aashi' as sender names in chat messages instead of 'unknown'",
      "acceptanceCriteria": [
        "Chat messages display 'Takshi' or 'Aashi' as sender names",
        "No messages show 'unknown' as the sender name",
        "Sender name correctly reflects the user's identity selection"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/chat/ChatMessageItem.tsx",
          "operation": "modify",
          "description": "Update the message sender display logic to show 'Takshi' or 'Aashi' based on the localStorage identity value when a message has no senderId or the profile cannot be resolved. Read the identity from localStorage.getItem('selectedIdentity') and map 'takshi' to 'Takshi' and 'aashi' to 'Aashi'. Remove or replace any 'unknown' fallback text with the appropriate identity name."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Apply consistent 'Takshi' and 'Aashi' sender name display logic across all pages that show user-generated content",
      "acceptanceCriteria": [
        "All pages that display user content show 'Takshi' or 'Aashi' names",
        "Consistent naming behavior across the entire application",
        "No instances of 'unknown' or unresolved sender names anywhere"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DailyCheckInPage.tsx",
          "operation": "modify",
          "description": "Update any user display logic to show 'Takshi' or 'Aashi' based on localStorage identity when displaying answer authors or user references. Ensure no 'unknown' text appears when showing who submitted answers."
        },
        {
          "path": "frontend/src/pages/ReactionsPage.tsx",
          "operation": "modify",
          "description": "Update the recent reactions feed to display 'Takshi' or 'Aashi' based on localStorage identity when showing who sent reactions. Replace any 'unknown' fallback with the identity name derived from localStorage.getItem('selectedIdentity')."
        },
        {
          "path": "frontend/src/pages/DailyNotesPage.tsx",
          "operation": "modify",
          "description": "Update note author display logic to show 'Takshi' or 'Aashi' based on localStorage identity when displaying note authors. Ensure consistent naming with no 'unknown' text."
        },
        {
          "path": "frontend/src/pages/DoodlesPage.tsx",
          "operation": "modify",
          "description": "Update drawing author display logic to show 'Takshi' or 'Aashi' based on localStorage identity when displaying who created drawings. Remove any 'unknown' fallback text."
        },
        {
          "path": "frontend/src/pages/MemoryWallPage.tsx",
          "operation": "modify",
          "description": "Update memory author display logic to show 'Takshi' or 'Aashi' based on localStorage identity when displaying photo captions or author information. Ensure no 'unknown' text appears."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Restrict admin panel access exclusively to the user 'takshi'",
      "acceptanceCriteria": [
        "Admin panel is only accessible when localStorage identity is 'takshi'",
        "Admin panel navigation card only appears for Takshi",
        "Aashi cannot access or see the admin panel"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Add a route guard for the /admin route that checks localStorage.getItem('selectedIdentity') === 'takshi'. If not takshi, redirect to the home page or show an access denied message. This ensures the admin panel route is only accessible to Takshi."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the admin panel navigation card visibility logic to only show when localStorage.getItem('selectedIdentity') === 'takshi'. The card should not appear at all for Aashi or any other identity."
        },
        {
          "path": "frontend/src/pages/AdminPanelPage.tsx",
          "operation": "modify",
          "description": "Add a client-side check at the component mount to verify localStorage.getItem('selectedIdentity') === 'takshi'. If not, show an access denied message or redirect to home. This provides an additional safeguard even if the route guard is bypassed."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Implement automatic daily question generation to ensure a new question appears every day",
      "acceptanceCriteria": [
        "A new daily check-in question appears automatically each day",
        "Users see a fresh question every 24 hours",
        "The system handles question rotation without requiring manual admin updates"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DailyCheckInPage.tsx",
          "operation": "modify",
          "description": "Add logic to check if today's question exists when the page loads. If getTodaysQuestion returns null and the user is viewing the current day, display a message indicating no question is available for today. Add a UI hint suggesting that scheduled questions can be set up in the admin panel (visible only to Takshi). This provides frontend feedback for the automatic question rotation system."
        },
        {
          "path": "frontend/src/pages/AdminPanelPage.tsx",
          "operation": "modify",
          "description": "Enhance the scheduled questions interface to make it clear that questions scheduled for future dates will automatically become active on their designated day. Add helper text explaining that the system will automatically rotate questions based on their scheduled dates. Consider adding a visual indicator showing which question is scheduled for today and upcoming days."
        }
      ]
    }
  ]
}